<?php

return [
    'advertising' => [
        'datatable' => [
            'created_at' => 'تاريخ الآنشاء',
            'date_range' => 'البحث بالتواريخ',
            'end_at' => 'الانتهاء في',
            'image' => 'الصورة',
            'link' => 'الرابط',
            'options' => 'الخيارات',
            'start_at' => 'يبدا في',
            'status' => 'الحاله',
            'advertising_group' => 'المجموعة الإعلانية',
        ],
        'form' => [
            'type' => 'نوع الاعلان',
            'end_at' => 'الانتهاء في',
            'image' => 'الصورة',
            'image_ar' => 'الصورة باللغة العربية',
            'image_en' => 'الصورة باللغة الإنجليزية',
            'link' => 'رابط الاعلان',
            'start_at' => 'يبدا في',
            'status' => 'الحاله',
            'sort' => 'الترتيب',
            'products' => 'المنتجات',
            'categories' => 'أقسام المنتجات',
            'groups' => 'المجموعات الإعلانية',
            'advert_time_status' => 'تحديد مدة الإعلان',
            'link_type' => [
                'label' => 'نوع الرابط',
                'external' => 'خارجى',
                'product' => 'منتجات',
                'category' => 'أقسام منتجات',
            ],
            'tabs' => [
                'general' => 'بيانات عامة',
            ],
        ],
        'routes' => [
            'create' => 'اضافة الاعلانات',
            'create_advert' => 'اضافة إعلان',
            'index' => 'الاعلانات',
            'update' => 'تعديل الاعلان',
            'all_adverts' => 'عرض الاعلانات',
        ],
        'alert' => [
            'select_position' => 'اختر مكان الاعلان',
            'select_products' => 'اختر المنتج',
            'select_categories' => 'اختر القسم',
            'select_groups' => 'اختر المجموعة الإعلانية',
        ],
        'validation' => [
            'end_at' => [
                'required' => 'من فضلك اختر تاريخ الانتهاء',
            ],
            'image' => [
                'required' => 'من فضلك اختر صورة الاعلان',
            ],
            'link' => [
                'required_if' => 'من فضلك ادخل رابط الاعلان',
            ],
            'product_id' => [
                'required' => 'من فضلك اختر المنتج',
                'exists' => 'منتج الاعلان غير موجود حاليا',
            ],
            'category_id' => [
                'required' => 'من فضلك اختر القسم',
                'exists' => 'قسم منتج الاعلان غير موجود حاليا',
            ],
            'start_at' => [
                'required' => 'من فضلك اختر تاريخ البدء',
            ],
            'link_type' => [
                'required' => 'من فضلك اختر نوع رابط الاعلان',
                'in' => 'نوع رابط الاعلان يجب ان يكون ضمن القيم: external,product,category',
            ],
            'group_id' => [
                'required' => 'من فضلك اختر مجموعة الاعلان',
                'exists' => 'مجموعة الاعلان غير موجودة حاليا',
            ],
            'image_ar' => [
                'required' => 'من فضلك اختر صورة الاعلان باللغة العربية',
                'image' => 'من فضلك ادخل صورة الاعلان باللغة العربية من نوع صورة',
                'mimes' => 'صورة الاعلان باللغة العربية يجب ان تكون ضمن',
                'max' => 'حجم صورة الاعلان باللغة العربية يجب الا يزيد عن',
            ],
            'image_en' => [
                'required' => 'من فضلك اختر صورة الاعلان باللغة الإنجليزية',
                'image' => 'من فضلك ادخل صورة الاعلان باللغة الإنجليزية من نوع صورة',
                'mimes' => 'صورة الاعلان باللغة الإنجليزية يجب ان تكون ضمن',
                'max' => 'حجم صورة الاعلان باللغة الإنجليزية يجب الا يزيد عن',
            ],
        ],
    ],
    'advertising_groups' => [
        'datatable' => [
            'created_at' => 'تاريخ الآنشاء',
            'date_range' => 'البحث بالتواريخ',
            'options' => 'الخيارات',
            'status' => 'الحاله',
            'title' => 'العنوان',
            'position' => 'المكان',
        ],
        'form' => [
            'title' => 'العنوان',
            'status' => 'الحاله',
            'sort' => 'الترتيب',
            'home' => 'الرئيسية',
            'categories' => 'الأقسام',
            'tabs' => [
                'general' => 'بيانات عامة',
            ],
            'position' => [
                'label' => 'مكان الاعلان',
                'home' => 'الرئيسية',
                'categories' => 'الأقسام',
            ],
            'item_style' => [
                'label' => 'عرض الإعلان فى التطبيق',
                'vertical' => 'رأسى',
                'horizontal' => 'أفقى',
            ],
        ],
        'routes' => [
            'create' => 'اضافة مجموعة اعلانيه',
            'index' => 'المجموعات الاعلانيه',
            'update' => 'تعديل مجموعة اعلانيه',
        ],
        'alert' => [
            'select_position' => 'اختر مكان الاعلان',
            'select_item_style' => 'اختر عرض الإعلان فى التطبيق',
            'no_ad_groups_now' => 'لا يوجد مجموعات إعلانية حاليا',
        ],
        'validation' => [
            'title' => [
                'required' => 'من فضلك ادخل العنوان',
                'unique' => 'هذا العنوان تم ادخالة من قبل',
            ],
            'position' => [
                'required' => 'من فضلك اختر مكان الاعلان',
                'in' => 'مكان الاعلان يجب ان يكون ضمن القيم: home,categories',
            ],
            'item_style' => [
                'required' => 'من فضلك اختر عرض الإعلان فى التطبيق',
                'in' => 'عرض الإعلان فى التطبيق يجب ان يكون ضمن القيم',
            ],
        ],
    ],
];
